src/cf/Catalogs/ВидыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВидыДействий</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапретитьПостановкуПодзадач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаВидимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидимостьДействийВПредметах</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Неактуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьТолькоЕслиВызвано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьУчастникамИзменятьПредмет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОбработкиПредмета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыОбработкиПредметов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/НаименованияЗадачУчастниковДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НаименованияЗадачУчастниковДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШаблонОписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АвтоподстановкиДляОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДействий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Функция</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФункцииУчастниковДействий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НаименованиеЭтапа</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДействий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ознакомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыДействий/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ОбновитьДоступностьВидимостьЭлементов();
	КонецЕсли;
	НаименованияЗадач.Параметры.УстановитьЗначениеПараметра("ВидДействия", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОбновитьДоступностьВидимостьЭлементов();
	
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	НаименованияЗадач.Параметры.УстановитьЗначениеПараметра("ВидДействия", Объект.Ссылка);
	Элементы.НаименованияЗадач.Обновить();
	ОбновитьДоступностьВидимостьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ИзмененВидДействия", Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипПриИзменении(Элемент)
	
	ОбновитьДоступностьВидимостьЭлементов();
	
	ИзменениеПредметаРазрешеноПоУмолчанию =
		Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыДействий.Исполнение")
		Или Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыДействий.Подписание")
		Или Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыДействий.Регистрация")
		Или Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыДействий.Согласование")
		Или Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипыДействий.Утверждение");
	
	Объект.РазрешитьУчастникамИзменятьПредмет = ИзменениеПредметаРазрешеноПоУмолчанию;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСпискаНаименованияЗадач

&НаКлиенте
Процедура НаименованияЗадачПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	
	Отказ = Истина;
	Если Объект.Ссылка.Пустая() Тогда

		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;
		
		ПоказатьОповещениеПользователя(
			НСтр("ru = 'Создание:'"), 
			ПолучитьНавигационнуюСсылку(Объект.Ссылка),
			Строка(Объект.Ссылка),
			БиблиотекаКартинок.Информация32);
	
	ИначеЕсли Модифицированность Тогда

		Если Не Записать() Тогда 
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Копирование Тогда
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные = Неопределено Тогда 
			Возврат;
		КонецЕсли;
		
		ТекущаяСтрока = Элемент.ТекущаяСтрока;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ЗначениеКопирования", ТекущаяСтрока);
	Иначе
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВидДействия", Объект.Ссылка);
	КонецЕсли;
	
	Открытьформу("РегистрСведений.НаименованияЗадачУчастниковДействий.Форма.ФормаЗаписи",
		ПараметрыФормы, Элементы.НаименованияЗадач);

КонецПроцедуры

&НаКлиенте
Процедура НаименованияЗадачОбработкаЗаписиНового(Элемент, НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ОбновитьДоступностьВидимостьЭлементов();

КонецПроцедуры

&НаКлиенте
Процедура НаименованияЗадачПослеУдаления(Элемент)
	
	ОбновитьДоступностьВидимостьЭлементов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьДоступностьВидимостьЭлементов()
	
	ПараметрыВыбораЭтапа = Новый Структура("ТипДействия", Объект.Тип);
	ДанныеВыбора = Перечисления.ЭтапыОбработкиПредметов.ПолучитьДанныеВыбора(ПараметрыВыбораЭтапа);
	
	Элементы.ЭтапОбработкиПредмета.Доступность = ДанныеВыбора.Количество() > 0;
	Элементы.НаименованияЗадачЭтап.Видимость = ДействияКлиентСервер.ЭтоДействиеСЭтапами(Объект.Тип);
	
	
	КоличествоСтрок = 0;
	Если Не Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	КОЛИЧЕСТВО (НаименованияЗадачУчастниковДействий.ВидДействия) КАК КоличествоСтрок
			|ИЗ
			|	РегистрСведений.НаименованияЗадачУчастниковДействий КАК НаименованияЗадачУчастниковДействий
			|Где
			|	НаименованияЗадачУчастниковДействий.ВидДействия = &ВидДействия"
		);
		Запрос.УстановитьПараметр("ВидДействия", Объект.Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			КоличествоСтрок = Выборка.КоличествоСтрок;
		КонецЕсли;
	КонецЕсли;
	НаименованияЗадачЗаголовок = НСтр("ru = 'Наименования задач'");
	Если КоличествоСтрок <> 0 Тогда
		НаименованияЗадачЗаголовок = СтрШаблон("%1 (%2)", НаименованияЗадачЗаголовок, КоличествоСтрок);
	КонецЕсли;
	Элементы.НаименованияЗадачГруппа.Заголовок = НаименованияЗадачЗаголовок;
	
КонецПроцедуры

#КонецОбласти
